Revit 2024 API
SKPImportOptions Class
 The import options used to import SKP format files.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class SKPImportOptions : BaseImportOptions
Visual Basic
Public Class SKPImportOptions _
	Inherits BaseImportOptions
Visual C++
public ref class SKPImportOptions : public BaseImportOptions
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BaseImportOptions
 Autodesk.Revit.DB.SKPImportOptions
See Also
SKPImportOptions Members
Autodesk.Revit.DB Namespace